; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	image0 - mode
	infrared1 - mode
	GroundStation2 - direction
	Star7 - direction
	GroundStation9 - direction
	GroundStation5 - direction
	Star10 - direction
	GroundStation6 - direction
	GroundStation0 - direction
	GroundStation4 - direction
	Star11 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Star8 - direction
	Star12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image0)
	(calibration_target instrument0 Star11)
	(supports instrument1 image0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star10)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument3 infrared1)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 Star11)
	(calibration_target instrument3 GroundStation6)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star14)
	(supports instrument4 infrared1)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation4)
	(supports instrument5 image0)
	(supports instrument5 infrared1)
	(calibration_target instrument5 GroundStation1)
	(calibration_target instrument5 GroundStation3)
	(calibration_target instrument5 Star11)
	(supports instrument6 image0)
	(supports instrument6 infrared1)
	(calibration_target instrument6 Star8)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon13)
)
(:goal (and
	(pointing satellite0 Phenomenon15)
	(pointing satellite1 Star10)
	(pointing satellite2 GroundStation3)
	(have_image Star12 infrared1)
	(have_image Phenomenon13 infrared1)
	(have_image Star14 infrared1)
	(have_image Phenomenon15 infrared1)
	(have_image Phenomenon16 infrared1)
))

)

; plan
1. (turn_to satellite1 star10 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star10)
   goals met: 1 of 8
2. (turn_to satellite0 star11 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star11)
   goals met: 1 of 8
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 8
4. (calibrate satellite0 instrument0 star11)
   added: (calibrated instrument0)
   goals met: 1 of 8
5. (turn_to satellite0 phenomenon16 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 phenomenon16)
   goals met: 1 of 8
6. (take_image satellite0 phenomenon16 instrument0 infrared1)
   added: (have_image phenomenon16 infrared1)
   goals met: 2 of 8
7. (turn_to satellite0 phenomenon13 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon13)
   goals met: 2 of 8
8. (take_image satellite0 phenomenon13 instrument0 infrared1)
   added: (have_image phenomenon13 infrared1)
   goals met: 3 of 8
9. (turn_to satellite0 star12 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star12)
   goals met: 3 of 8
10. (take_image satellite0 star12 instrument0 infrared1)
   added: (have_image star12 infrared1)
   goals met: 4 of 8
11. (turn_to satellite0 star14 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star14)
   goals met: 4 of 8
12. (take_image satellite0 star14 instrument0 infrared1)
   added: (have_image star14 infrared1)
   goals met: 5 of 8
13. (turn_to satellite0 phenomenon15 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 phenomenon15)
   goals met: 6 of 8
14. (take_image satellite0 phenomenon15 instrument0 infrared1)
   added: (have_image phenomenon15 infrared1)
   goals met: 7 of 8
15. (turn_to satellite2 groundstation3 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 groundstation3)
   goals met: 8 of 8
